In [1]:
# Import packages

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
# Creating series ds from list

x=['Shreenidhi','Ganesh','Tarak','Mrithyunjay','Kevin']
name=pd.Series(x)
name

0     Shreenidhi
1         Ganesh
2          Tarak
3    Mrithyunjay
4          Kevin
dtype: object

In [3]:
# Creating json key:value pair in series

y={'Country':['India','Ireland','Denmark','Brazil','Italy']}
kv=pd.Series(y)
kv

Country    [India, Ireland, Denmark, Brazil, Italy]
dtype: object

In [4]:
# Creating series ds from list

L=['English','Kannada','Hindi','Maths','Physics']
lang=pd.Series(L)
lang

0    English
1    Kannada
2      Hindi
3      Maths
4    Physics
dtype: object

In [5]:
# Series ds to DataFrame ds
NAMES=pd.DataFrame(name)
NAMES

             0
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin

In [6]:
# Series ds to DataFrame ds
kyvl=pd.DataFrame(kv)
kyvl

                                                0
Country  [India, Ireland, Denmark, Brazil, Italy]

In [7]:
# Series ds to DataFrame ds
language=pd.DataFrame(lang)
language

         0
0  English
1  Kannada
2    Hindi
3    Maths
4  Physics

In [8]:
# concatinate 2 DataFrames along columns (axis=1)

cnctc=pd.concat([NAMES,language],axis=1)
cnctc

             0        0
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [9]:
# names for columns

cnctc.columns=['Names','Language']
cnctc

         Names Language
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [10]:
# concatinate 2 DataFrames along rows (axis=0)

cnctr=pd.concat([NAMES,language],axis=0)
cnctr

             0
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin
0      English
1      Kannada
2        Hindi
3        Maths
4      Physics

In [11]:
# name for column
cnctr.columns=['Unknown']
cnctr

       Unknown
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin
0      English
1      Kannada
2        Hindi
3        Maths
4      Physics

In [12]:
# One liner for concating

oneliner=pd.DataFrame(list(zip(x,L)))
oneliner

             0        1
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [13]:
# names for columns
oneliner.columns=['Names','Subject']
oneliner

         Names  Subject
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

## 19_8_21

In [14]:
# Index naming

country=['India','America','China','Africa','England']
cnty=pd.Series(country,index=['aa','bb','cc','dd','ee'])
cnty

aa      India
bb    America
cc      China
dd     Africa
ee    England
dtype: object

In [15]:
cndf=pd.DataFrame(cnty)
cndf

          0
aa    India
bb  America
cc    China
dd   Africa
ee  England

In [16]:
# Retrieve value based from index value

cnty['bb']

'America'

In [17]:
# Retrieve value based from index value

cnty[['ee','dd']]

ee    England
dd     Africa
dtype: object

In [18]:
# Concat two DataFrames with different index value

n=['Akshay','Bharath','Chintan','Dobby','Elina','Farhan']
na=pd.Series(n)
na

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
dtype: object

In [19]:
c=['Amazon','Google','Apple','Delloite','Microsoft']
co=pd.Series(c,index=['a','b','c','d','e'])
co

a       Amazon
b       Google
c        Apple
d     Delloite
e    Microsoft
dtype: object

In [20]:
nam=pd.DataFrame(na)
nam

         0
0   Akshay
1  Bharath
2  Chintan
3    Dobby
4    Elina
5   Farhan

In [21]:
com=pd.DataFrame(co)
com

           0
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [22]:
# Concat two DataFrames with different index value along column

nacm=pd.concat([nam,com],axis=1)
nacm

         0          0
0   Akshay        NaN
1  Bharath        NaN
2  Chintan        NaN
3    Dobby        NaN
4    Elina        NaN
5   Farhan        NaN
a      NaN     Amazon
b      NaN     Google
c      NaN      Apple
d      NaN   Delloite
e      NaN  Microsoft

In [23]:
# Concat two DataFrames with different index value along row

nacmrow=pd.concat([nam,com],axis=0)
nacmrow

           0
0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [24]:
# Slicing

nacm[1:'d']

         0         0
1  Bharath       NaN
2  Chintan       NaN
3    Dobby       NaN
4    Elina       NaN
5   Farhan       NaN
a      NaN    Amazon
b      NaN    Google
c      NaN     Apple
d      NaN  Delloite

In [25]:
# Reverse Slicing

nacm[::-1]

         0          0
e      NaN  Microsoft
d      NaN   Delloite
c      NaN      Apple
b      NaN     Google
a      NaN     Amazon
5   Farhan        NaN
4    Elina        NaN
3    Dobby        NaN
2  Chintan        NaN
1  Bharath        NaN
0   Akshay        NaN

In [26]:
nacmrow[::-1]

           0
e  Microsoft
d   Delloite
c      Apple
b     Google
a     Amazon
5     Farhan
4      Elina
3      Dobby
2    Chintan
1    Bharath
0     Akshay

In [27]:
nacmrow[2:'e']

           0
2    Chintan
3      Dobby
4      Elina
5     Farhan
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [28]:
n[0:2]

['Akshay', 'Bharath']

In [29]:
print()

In [30]:
print(na)

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
dtype: object

In [31]:
na.name='Students'
print(na)
print(type(na))

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
Name: Students, dtype: object
<class 'pandas.core.series.Series'>

In [32]:
nacm.columns=['Colums1','Column2']
nacm

   Colums1    Column2
0   Akshay        NaN
1  Bharath        NaN
2  Chintan        NaN
3    Dobby        NaN
4    Elina        NaN
5   Farhan        NaN
a      NaN     Amazon
b      NaN     Google
c      NaN      Apple
d      NaN   Delloite
e      NaN  Microsoft

In [33]:
nacm.index.name='Index'
nacm

       Colums1    Column2
Index
0       Akshay        NaN
1      Bharath        NaN
2      Chintan        NaN
3        Dobby        NaN
4        Elina        NaN
5       Farhan        NaN
a          NaN     Amazon
b          NaN     Google
c          NaN      Apple
d          NaN   Delloite
e          NaN  Microsoft

In [34]:
nacm.columns

Index(['Colums1', 'Column2'], dtype='object')

In [35]:
nacm.values

array([['Akshay', nan],
       ['Bharath', nan],
       ['Chintan', nan],
       ['Dobby', nan],
       ['Elina', nan],
       ['Farhan', nan],
       [nan, 'Amazon'],
       [nan, 'Google'],
       [nan, 'Apple'],
       [nan, 'Delloite'],
       [nan, 'Microsoft']], dtype=object)

In [36]:
nacm.size

22

In [37]:
nacm.empty

False

In [38]:
nacm.isnull()

       Colums1  Column2
Index
0        False     True
1        False     True
2        False     True
3        False     True
4        False     True
5        False     True
a         True    False
b         True    False
c         True    False
d         True    False
e         True    False

In [39]:
emp=['One','','']
empy=pd.Series(emp)
empy.empty

False

In [40]:
employ=pd.DataFrame()
employ.empty

True

In [41]:
emp1=['One','','']
emps=pd.Series(emp1)
emps1=pd.DataFrame(emps)
emps1

     0
0  One
1
2

In [42]:
emps1.isnull()

       0
0  False
1  False
2  False

## 23/8/21

In [43]:
# Create table of 4 columns weather,temperature,humidity,rainy or not
# and with index name (days) of values from monday to sunday

I=['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','saturday']
W=['Sunny','Rainy','Cloudy','Cloudy and Rainy','Sunny and cloudy','Cloudy','Sunny']
T=['33C','19C','23C','23C','27C','25C','33']
H=['NA','NA','NA','NA','NA','NA','NA']
R=['No','Yes','No','Yes','No','No','No']
IS=pd.Series(I)
WS=pd.Series(W)
TS=pd.Series(T)
HS=pd.Series(H)
RS=pd.Series(R)
ID=pd.DataFrame(IS)
WD=pd.DataFrame(WS)
TD=pd.DataFrame(TS)
HD=pd.DataFrame(HS)
RD=pd.DataFrame(RS)
Z=pd.concat([WD,TD,HD,RD],axis=1)
Z.index=I
Z.index.name='Days'
Z.columns=['Weather','Temperature','Humidity','RainFall']
Z

                    Weather Temperature Humidity RainFall
Days
Sunday                Sunny         33C       NA       No
Monday                Rainy         19C       NA      Yes
Tuesday              Cloudy         23C       NA       No
Wednesday  Cloudy and Rainy         23C       NA      Yes
Thursday   Sunny and cloudy         27C       NA       No
Friday               Cloudy         25C       NA       No
saturday              Sunny          33       NA       No

In [44]:
# Retrieve information from DataFrame -----> 1. loc 2. iloc
# And ways to retrieve info-----> By 1.value, 2.list, 3.slicing, 4.conditions, 5.callable function

# 1.By Value
# By value(name)--------df.loc[row_value,column_value]
zz=Z.loc['Sunday','Temperature']
zz

'33C'

In [45]:
# By value(index) --------df.iloc[row_index_number,column_index_number]

yy=Z.iloc[0,1]
yy

'33C'

In [46]:
# 2. By list---> Value(name)
xx=Z.loc['Monday',['Weather','Temperature','RainFall']]
xx

Weather        Rainy
Temperature      19C
RainFall         Yes
Name: Monday, dtype: object

In [47]:
# By index value
vv=Z.iloc[[1],[0,1,2,3]]
vv

       Weather Temperature Humidity RainFall
Days
Monday   Rainy         19C       NA      Yes

In [48]:
bv=Z.loc[['Monday','Wednesday','Friday'],['Weather','Temperature','RainFall']]
bv

                    Weather Temperature RainFall
Days
Monday                Rainy         19C      Yes
Wednesday  Cloudy and Rainy         23C      Yes
Friday               Cloudy         25C       No

In [49]:
av=Z.iloc[[1,2,3],[0]]
av

                    Weather
Days
Monday                Rainy
Tuesday              Cloudy
Wednesday  Cloudy and Rainy

In [50]:
# 3. By slicing 
# By value(name) 
# Slicing with value doesn't exclude last value i.e both Friday and RainFall are included

cv=Z.loc['Monday':'Friday','Weather':'RainFall']
cv

                    Weather Temperature Humidity RainFall
Days
Monday                Rainy         19C       NA      Yes
Tuesday              Cloudy         23C       NA       No
Wednesday  Cloudy and Rainy         23C       NA      Yes
Thursday   Sunny and cloudy         27C       NA       No
Friday               Cloudy         25C       NA       No

In [51]:
# Slicing with index numbers excludes last values i.e 6th and 3rd positioned values are excluded

dv=Z.iloc[0:6,0:3] 
dv

                    Weather Temperature Humidity
Days
Sunday                Sunny         33C       NA
Monday                Rainy         19C       NA
Tuesday              Cloudy         23C       NA
Wednesday  Cloudy and Rainy         23C       NA
Thursday   Sunny and cloudy         27C       NA
Friday               Cloudy         25C       NA

In [52]:
# Slicing with value(name)
cv=Z.loc['Monday':'Thursday',:]
cv

                    Weather Temperature Humidity RainFall
Days
Monday                Rainy         19C       NA      Yes
Tuesday              Cloudy         23C       NA       No
Wednesday  Cloudy and Rainy         23C       NA      Yes
Thursday   Sunny and cloudy         27C       NA       No

In [53]:
# Slicing with index number
dv=Z.iloc[0:4,:] 
dv

                    Weather Temperature Humidity RainFall
Days
Sunday                Sunny         33C       NA       No
Monday                Rainy         19C       NA      Yes
Tuesday              Cloudy         23C       NA       No
Wednesday  Cloudy and Rainy         23C       NA      Yes

## 24/8/21

In [54]:
# json format to create DataFrame
# import pandas as pd  
# import numpy as ny

All={'English':[88,87,77,66,87,86,77,88,77,65,83,55,54,99,90,89,89,99,87,67],
     'Kannada':[88,87,77,66,87,86,77,88,77,65,87,86,77,88,77,65,87,55,90,99],
     'Maths':[66,87,86,77,88,77,65,87,86,77,86,77,88,77,65,87,55,77,65,87],
     'Physics':[77,66,87,86,77,88,77,65,87,55,54,99,90,89,89,99,89,89,99,78],
     'Chemistry':[66,87,86,77,88,77,65,87,55,54,99,90,89,89,99,89,87,55,54,99],
     'Biology':[77,66,87,86,77,88,77,65,87,55,54,99,90,89,89,99,89,89,99,78]}
st=['Adam','Stark','Catherin','Devin','Elay','Fin','Gusto','Hela',
                           'Isiquel','Jack','Stark','Lisa','Mark','Neo','Oswald','Peggy','Queeny','Rose','Stark','Tony']
df=pd.DataFrame(All,index=st)
#df.index=st
df.index.name='Names'
df

          English  Kannada  Maths  Physics  Chemistry  Biology
Names
Adam           88       88     66       77         66       77
Stark          87       87     87       66         87       66
Catherin       77       77     86       87         86       87
Devin          66       66     77       86         77       86
Elay           87       87     88       77         88       77
Fin            86       86     77       88         77       88
Gusto          77       77     65       77         65       77
Hela           88       88     87       65         87       65
Isiquel        77       77     86       87         55       87
Jack           65       65     77       55         54       55
Stark          83       87     86       54         99       54
Lisa           55       86     77       99         90       99
Mark           54       77     88       90         89       90
Neo            99       88     77       89         89       89
Oswald         90       77     65       89         99       89
Peggy          89       65     87       99         89       99
Queeny         89       87     55       89         87       89
Rose           99       55     77       89         55       89
Stark          87       90     65       99         54       99
Tony           67       99     87       78         99       78

In [55]:
df.loc['Stark','English']

Names
Stark    87
Stark    83
Stark    87
Name: English, dtype: int64

## 25/8/21

In [56]:
# groupby
# used to group all the values/specific values in DataFrame

In [57]:
# just creates the object of group 

df.groupby('Physics')

In [58]:
# By passing Physics column to 'groupby' it 'groups' every individual values  

df.groupby('Physics').groups

{54: ['Stark'], 55: ['Jack'], 65: ['Hela'], 66: ['Stark'], 77: ['Adam', 'Elay', 'Gusto'], 78: ['Tony'], 86: ['Devin'], 87: ['Catherin', 'Isiquel'], 88: ['Fin'], 89: ['Neo', 'Oswald', 'Queeny', 'Rose'], 90: ['Mark'], 99: ['Lisa', 'Peggy', 'Stark']}

In [59]:
# Using get_group with groupby we can group one specific value

df.groupby('Physics').get_group(89)

        English  Kannada  Maths  Physics  Chemistry  Biology
Names
Neo          99       88     77       89         89       89
Oswald       90       77     65       89         99       89
Queeny       89       87     55       89         87       89
Rose         99       55     77       89         55       89

In [60]:
# Merge DataFrames 

A={'Emp_ID':[100,101,102,103,104,105,106,107],
   'Emp_Name':['Ash','Bin','Cath','Das','Eion','Fani','Gadop','George']}
B={'Emp_ID':[100,101,102,103,104,105,106],
   'Emp_Dept':['Physics','Chemistry','Maths','DataScience','English','Hindi','Kannada']}
C={'Emp_Name':['Ash','Bin','Cath','Das','Eion','Fani','Gadop','George'],
   'Emp_Salary':['100000','20000','15000','12000','18000','23000','56000','19000']}
AA=pd.DataFrame(A)
BB=pd.DataFrame(B)
CC=pd.DataFrame(C)

In [61]:
AB=pd.merge(AA,BB,on='Emp_ID',how='inner')
AB

   Emp_ID Emp_Name     Emp_Dept
0     100      Ash      Physics
1     101      Bin    Chemistry
2     102     Cath        Maths
3     103      Das  DataScience
4     104     Eion      English
5     105     Fani        Hindi
6     106    Gadop      Kannada

In [62]:
AB=pd.merge(AA,BB,on='Emp_ID',how='outer')
AB

   Emp_ID Emp_Name     Emp_Dept
0     100      Ash      Physics
1     101      Bin    Chemistry
2     102     Cath        Maths
3     103      Das  DataScience
4     104     Eion      English
5     105     Fani        Hindi
6     106    Gadop      Kannada
7     107   George          NaN

In [63]:
AB=pd.merge(AA,BB,on='Emp_ID',how='left')
AB

   Emp_ID Emp_Name     Emp_Dept
0     100      Ash      Physics
1     101      Bin    Chemistry
2     102     Cath        Maths
3     103      Das  DataScience
4     104     Eion      English
5     105     Fani        Hindi
6     106    Gadop      Kannada
7     107   George          NaN

In [64]:
AB=pd.merge(AA,BB,on='Emp_ID',how='right')
AB

   Emp_ID Emp_Name     Emp_Dept
0     100      Ash      Physics
1     101      Bin    Chemistry
2     102     Cath        Maths
3     103      Das  DataScience
4     104     Eion      English
5     105     Fani        Hindi
6     106    Gadop      Kannada

In [85]:
ABC=pd.merge(AB,CC,on='Emp_Name',how='outer')
ABC

   Emp_ID Emp_Name     Emp_Dept Emp_Salary
0   100.0      Ash      Physics     100000
1   101.0      Bin    Chemistry      20000
2   102.0     Cath        Maths      15000
3   103.0      Das  DataScience      12000
4   104.0     Eion      English      18000
5   105.0     Fani        Hindi      23000
6   106.0    Gadop      Kannada      56000
7     NaN   George          NaN      19000

In [76]:
ABC.loc[7,'Emp_ID']

nan

In [77]:
# To fill NAN values at all places

ABC.fillna('IGNORE THESE VALUES').astype(str)

                Emp_ID Emp_Name             Emp_Dept Emp_Salary
0                100.0      Ash              Physics     100000
1                101.0      Bin            Chemistry      20000
2                102.0     Cath                Maths      15000
3                103.0      Das          DataScience      12000
4                104.0     Eion              English      18000
5                105.0     Fani                Hindi      23000
6                106.0    Gadop              Kannada      56000
7  IGNORE THESE VALUES   George  IGNORE THESE VALUES      19000

In [78]:
# So to fill this nan with values

ABC.Emp_ID.fillna(107).astype(int)

0    100
1    101
2    102
3    103
4    104
5    105
6    106
7    107
Name: Emp_ID, dtype: int32

In [79]:
# Here main DataFrame is not affected as we are not assigning

ABC

   Emp_ID Emp_Name     Emp_Dept Emp_Salary
0   100.0      Ash      Physics     100000
1   101.0      Bin    Chemistry      20000
2   102.0     Cath        Maths      15000
3   103.0      Das  DataScience      12000
4   104.0     Eion      English      18000
5   105.0     Fani        Hindi      23000
6   106.0    Gadop      Kannada      56000
7     NaN   George          NaN      19000

In [80]:
# To solve previous problem i.e assigning

ABC.Emp_Dept=ABC.Emp_Dept.fillna('AI/ML').astype(str)
ABC

   Emp_ID Emp_Name     Emp_Dept Emp_Salary
0   100.0      Ash      Physics     100000
1   101.0      Bin    Chemistry      20000
2   102.0     Cath        Maths      15000
3   103.0      Das  DataScience      12000
4   104.0     Eion      English      18000
5   105.0     Fani        Hindi      23000
6   106.0    Gadop      Kannada      56000
7     NaN   George        AI/ML      19000